---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Schema.GUID
source: html/a2aa971a-5270-c35d-74c1-ee8cbec0261b.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.GUID Property

The identifier of the Schema.
 Setter made unavailable, because it would violate set-correctness

## Syntax (C#)
```csharp
public Guid GUID { get; }
```